app/controllers/images_controller.rb

  def create
    if @gallery && params[:avatars]
        params[:avatars].values.each { |avatar|
          @gallery.images.create(avatar: avatar)
---
INSERT INTO "images" ("created_at", "updated_at", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "galleries" ("created_at", "updated_at", "name") VALUES (?, ?, ?)  [["created_at", "2020-05-30 08:28:33.595899"], ["updated_at", "2020-05-30 08:28:33.595899"], ["name", "My gallery"]]

    def set_gallery
      @gallery = Gallery.find_or_create_by(name: 'My gallery')
---
SELECT  "galleries".* FROM "galleries" WHERE "galleries"."name" = ? LIMIT ?  [["name", "My gallery"], ["LIMIT", 1]]